HELYXcore-4.4.0/examples/legacy/multiphase/interDyMFoam/laminar/sloshingCylinder/system/helyxHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      helyxHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/helyxHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    sloshingCylinder.obj
    {
        type closedTriSurfaceMesh;
        name sloshingCylinder;
    }
};

castellatedMeshControls
{
    features
    (
    );

    refinementSurfaces
    {
        sloshingCylinder
        {
            level (1 1);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        sloshingCylinder
        {
            mode inside;
            levels ((1E15 1));
        }
    }

    locationInMesh (1e-5 1e-5 1e-5);
}

snapControls
{
    // Per final patch (so not geometry!) the layer information
    featureEdges
    {
    }
}

addLayersControls
{
    layers
    {
    }
}

writeFlags
(
);

mergeTolerance 1e-6;

// ************************************************************************* //
