HELYXcore-4.4.0/examples/legacy/multiphase/interDyMFoam/laminar/sloshingCylinder/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication helyxHexMesh -overwrite
cp 0/alpha.water.orig 0/alpha.water
runApplication setFields
runApplication `getApplication`

#------------------------------------------------------------------------------
